app/views/portfolios/my_portfolios.html.erb

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? ORDER BY "portfolios"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
<ul>
  <% current_user.created_portfolios.each do |portf| %>