app/controllers/comments_controller.rb

    def create
        @portfolio = Portfolio.find_by_id(params[:portfolio_id])
        @comment = @portfolio.comments.build(comment_params)
        if @comment.save
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "portfolio_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["portfolio_id", 5], ["content", "Hi"], ["created_at", "2021-04-26 21:18:45.359669"], ["updated_at", "2021-04-26 21:18:45.359669"]]