app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
    def index
        @portfolio = Portfolio.all

INSERT INTO "portfolios" ("name", "description", "initial_balance", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fresh"], ["description", "fresh"], ["initial_balance", 2736364], ["created_at", "2021-04-26 21:25:12.109095"], ["updated_at", "2021-04-26 21:25:12.109095"], ["user_id", 2]]
---
    def create
        @portfolio = Portfolio.new(portfolio_params)

        if @portfolio.save

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @portfolio = Portfolio.find_by(id: params[:id])
        @portfolio_creator = User.find_by(id: @portfolio.user_id)

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def edit
        @portfolio = Portfolio.find_by(id: params[:id])

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "portfolios" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["name", "Portafolio editado"], ["description", "Prueba de description editado"], ["updated_at", "2021-04-25 12:37:07.107524"], ["id", 2]]
---
    def update
        @portfolio = Portfolio.find_by(id: params[:id])
        @portfolio.update(portfolio_params)

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 2]]
---
    def destroy
        #TODO: DRY THIS UP BRO
        @portfolio = Portfolio.find_by(id: params[:id])
        @portfolio.destroy