app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "den"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by_email(params[:user][:email])

INSERT INTO "users" ("name", "password_digest", "email", "uid", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "61602179"], ["LIMIT", 1]]
---
    def github_omniauth
        @user = User.find_or_create_by(uid: auth[:uid]) do |u|