app/controllers/trades_controller.rb

    def create
        @portfolio = Portfolio.find_by_id(params[:portfolio_id])
        @trade = @portfolio.trades.build(trade_params)
        # Check balance
        @new_balance = @portfolio.current_balance - (@trade.quantity.to_i * @trade.price.to_f)
        if @new_balance > 0
            @portfolio.update(current_balance: @new_balance)
            if @trade.save
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "portfolios" SET "current_balance" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["current_balance", 12343], ["updated_at", "2021-04-28 21:53:35.114366"], ["id", 2]]
INSERT INTO "trades" ("coin_name", "coin_id", "price", "quantity", "user_id", "portfolio_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def create_portfolio_trade
        @coin_id = params[:coin_id]
        @portfolio_id = params[:portfolio_id]
        @coin = Cryptocurrency.find_by_id(params[:coin_id])
        #@coin.Portfolio.find_by(params[:coin_id])
        @portfolio = Portfolio.find_by_id(params[:portfolio_id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def show
        @portfolio = Portfolio.find_by(id: params[:portfolio_id])
        @trade = @portfolio.trades.find_by(id: params[:id])
        # if Cryptocurrency.all.count > 0
        #     Cryptocurrency.refresh
        # end
        # Api.new.get_top_20_cryptocurrencies
        @coin = Cryptocurrency.find_by_id(@trade.coin_id)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trades".* FROM "trades" WHERE "trades"."portfolio_id" = ? AND "trades"."id" = ? LIMIT ?  [["portfolio_id", 1], ["id", nil], ["LIMIT", 1]]
SELECT "trades".* FROM "trades" WHERE "trades"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

    def destroy
        @portfolio = Portfolio.find_by(id: params[:portfolio_id])
        current_value = params[:total_current_value]
        new_balance = @portfolio.current_balance + current_value.to_f
        @portfolio.update(current_balance: new_balance)
        @trade = Trade.find_by(id: params[:trade_id])
        @trade.destroy
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "portfolios" SET "current_balance" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["current_balance", nil], ["updated_at", "2021-04-29 17:00:45.984318"], ["id", 5]]
SELECT "trades".* FROM "trades" WHERE "trades"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "trades" WHERE "trades"."id" = ?  [["id", 20]]